export const regexp = {
  // 整数
  int: /^-?[0-9]\d*$/,
  // 正整数
  positiveInt: /^[1-9]\d*$/,
  // 非负数
  nNegativeInt: /(^[1-9]\d*$)|0/,
  // 比例
  percent: /^100$|^(\d|[1-9]\d)(\.[0-9]([0-9])?)*$/,
  // 排序值
  sort: /^(0|([1-9]\d{0,3}))$/,
  // 密码
  password: /^(?![0-9]+$)(?![a-zA-Z]+$)[A-Za-z_][A-Za-z_0-9]{4,11}$/,
  // 金额
  money: /(^[1-9](\d{1,5})?(\.[0-9]{1,2})?$)|(^[0-9]\.[0-9]([0-9])?$)/,
  // 可为0金额
  zMoney: /(^[1-9](\d{1,7})?(\.[0-9]{1,2})?$)|(^[0-9]\.[0-9]([0-9])?$)|0/,
  // 邮箱
  // eslint-disable-next-line no-useless-escape
  email: /^([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+\.(?:com|cn)$/,
  // 手机号码
  tel: /^1[3|4|5|6|7|8|9]\d{9}$/,
  // 座机号码
  phone: /\d{3}-?\d{8}|\d{4}-?\d{7}|^400|^800/,
  // url
  // eslint-disable-next-line no-useless-escape
  url: /^(https?):\/\/[\w-]+(\.[\w\-]+)+([\w\-\.,@?^=%&:\/~\+#]*[\w\-\@?^=%&\/~\+#])?$/
}
